{
  "posts": [
    {
      "id": "1745630054219",
      "title": "Pandemic Shifted Palm Beach Real Estate Into Full-Throttle Overdrive. Here Are 5 Takeaways",
      "slug": "pandemic-shifted-palm-beach-real-estate-into-fullthrottle-overdrive-here-are-5-takeaways",
      "date": "2025-03-24",
      "author": "Linda R. Olsson",
      "content": "<h3>The real-estate frenzy sparked by the arrival of coronavirus pandemic in 2020 has had lasting effects on Palm Beach real estate. Here are some highlights.</h3><p>As Palm Beach looks back five years to the arrival of the coronavirus pandemic, few could have predicted how the&nbsp;health crisis would upend&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/real-estate-news/\"><u>the town’s real estate market</u></a>.&nbsp;</p><p>But “upend” seems almost too tame a word to describe how the pandemic&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/11/11/how-the-pandemic-real-estate-boom-sent-palm-beach-home-values-soaring/75878609007/\"><u>helped propel Palm Beach residential sale prices, asking prices and property values into the stratosphere</u></a>.</p><p>Such a scenario, however, seemed remote when the Town&nbsp;Council&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/news/2020/05/03/coronavirus-timeline-of-pandemic-and-abrupt-end-of-palm-beach-season/112278724/\"><u>issued its first&nbsp;pandemic-related directive on March 16, 2020</u></a>. Advising residents to “shelter in place” because of the health crisis, the council’s directive came four days after the World Health Organization declared COVID-19 to be a global pandemic.</p><p>And in those first days, new real estate activity on the island almost immediately ground to a halt.</p><p>Yet barely six weeks later, real estate observers were watching, many in disbelief, as&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://palmbeachdailynews.com/story/business/real-estate/2021/01/21/palm-beach-home-sales-skyrocket-fourth-quarter-reports-show/4235209001/\"><u>out-of-towners descended on the island en masse, hoping to secure a house in which to weather the pandemic</u></a>.</p><img src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/73538575007-pbn-crop-est-section-aerial-2018-a-frame.webp?resize=1024%2C568&amp;ssl=1\"><p>Consider how seasoned Palm Beach real estate attorney Guy&nbsp;Rabideau summed up the situation for the Palm Beach Daily News on April 29, 2020, about six weeks into the pandemic. “During the initial phase (of the health crisis), a lot of people panicked and tried to cancel (real estate) contracts. But activity picked up last week,”&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rabideauklein.com/newsroom/klein-makes-partner-at-renamed-rabideau-klein-real-estate-law-firm-2-2/\"><u>Rabideau said at the time</u></a>, “and this week it appears to me we’re having a near-normal week for the season. I can’t quite believe that, but it looks like we have turned the corner on panic.”</p><p>The panic somehow had melted into the beginnings of real estate boom that would astound even seasoned brokers and agents on the island. And although&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/01/18/palm-beach-florida-real-estate-sales-volume-fell-in-2023-fourth-quarter-sales-reports-confirm/72257487007/\"><u>the frenzy has cooled over the past two years</u></a>, its effects still linger in Palm Beach, where prices remain far higher and the number of houses for sale far fewer than before the pandemic.&nbsp;</p><p>On the anniversary of the Town Council’s initial COVID-19 directive, here are five local real estate takeaways from the pandemic and its aftermath.</p><h2>1. Why did buyers flock to Palm Beach after the pandemic began?</h2><p>Initially looking to buy or rent spacious, warm-weather havens in which to ride out the health crisis, buyers were also drawn by the state’s favorable tax picture relative to other states and by Palm Beach’s longtime attractions&nbsp;— its security, natural beauty, handsome architecture and resort-like atmosphere.</p><p>As the work-from-anywhere trend became firmly entrenched, more buyers chose to make Palm Beach their primary residence — and they were younger, many with children.&nbsp;Wearing masks and adopting “social distance” techniques, house-hunters&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2022/05/03/palm-beach-real-estate-prices-keep-rising-homes-condos-property/7445790001/\"><u>put to their real estate agents questions</u></a>&nbsp;about the quality of area schools and universities, medical facilities and even cultural venues, all factors important to people who were putting down roots.&nbsp;</p><p>One agent even described “planeloads” of investment bankers, many arriving by private jet, who descended on Palm Beach looking for properties — and with the cash to buy them, thanks to Wall Street’s overall strong performance in the years leading up to the pandemic.</p><img src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/b5539c49-9212-4c85-a8e8-84ef56cf79a7-PBN_535_N_County_Rd_LawnVu_SmRes_PictureItSold.webp?resize=1024%2C568&amp;ssl=1\" alt=\"\"><h2>2. How did the laws of supply and demand affect the island’s housing market?&nbsp;</h2><p>With real estate activity ramping up during the second half of 2020, Palm Beach’s available rental inventory dwindled. And as the pandemic dragged on, buyers began tearing through the supply of single-family&nbsp;homes, property records show. Once those were depleted, a spurt of condominium and cooperative-apartment purchases followed.</p><p>And as any first-year economics professor might expect, the laws of dwindling supply and intensifying demand began driving up home prices. The growing scarcity of residences was exacerbated by would-be sellers who decided to stay put,&nbsp;<a target=\"_blank\" rel=\"noreferrer noopener\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2021/10/24/after-busy-summer-palm-beach-real-estate-agents-scramble-find-listings/6122517001/\"><u>fearing they would not find anything comparable to their homes on the island</u></a>.&nbsp;More than one real estate agent reported selling a house to an out-of-state buyer sight unseen.</p><p>Within a couple of years of the pandemic’s arrival, asking and sale prices had frequently&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/08/14/house-sells-for-nearly-twice-its-2021-price-on-pam-beachs-north-end/74759032007/\"><u>doubled</u></a>&nbsp;— and sometimes even tripled.&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2022/02/23/florida-real-estate-palm-beach-house-sells-3-million-over-asking/6895005001/\"><u>Bidding wars</u></a>&nbsp;became common, according to reporting by the Palm Beach Daily News, which has tracked pandemic-linked sales in detail.&nbsp;</p><p>And as usual in the town’s single-family market, the demand was greatest for better-quality homes that were new, newer, recently renovated and on the water.</p><h2>3. What made 2021 such a key year for Palm Beach real estate?&nbsp;</h2><p>Perhaps&nbsp;<a target=\"_blank\" rel=\"noreferrer noopener\" href=\"https://www.palmbeachdailynews.com/story/lifestyle/real-estate/2020/01/16/palm-beach-homes-single-family-sales-up-in-4th-quarter-with-record-setter-skewing-average-price-reports-show/112150466/\"><u>the most dramatic effects of the boom came during the watershed year of 2021</u></a>, when total residential real estate sales volume in Palm Beach&nbsp;— including single-family homes, condos, co-ops and townhouses — for the first time broke the $5 billion mark. That figure nearly doubled the tally for 2020, which had set its own town record at $2.9 billion.</p><p>By contrast, in&nbsp;the pre-pandemic year of 2019, the total sales volume had clocked in at about $1.3 billion.&nbsp;</p><p>The year 2021 also saw&nbsp;<a target=\"_blank\" rel=\"noreferrer noopener\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2021/11/02/which-5-real-estate-sales-broke-price-records-palm-beach-year/6243388001/\"><u>new town sale-price records set in six major property categories in Palm Beach</u></a>&nbsp;— ocean-to-lake estates; oceanfront homes without lake frontage; lakeside properties; condos; townhouses; and vacant lots.&nbsp;Some of those records have since been broken.</p><p>Competition for the limited number of properties led to some striking flips during the height of the pandemic, including one memorable deal that closed in May 2021. That’s when paycheck-loan entrepreneur Allan Jones&nbsp;<a target=\"_blank\" rel=\"noreferrer noopener\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2021/05/05/palm-beach-estate-flipped-42-m-15-m-more-than-sold-january/4958751001/\"><u>sold, for a recorded $41.7 million</u></a>, a lakeside estate that he had bought about four months earlier for $26.2 million at 320 Island Road, stunning real estate brokers and agents town-wide.</p><p>The boom also stretched into other parts of Palm Beach County. The effects have been particularly noticeable in West Palm Beach, where financial firms and other companies have turned a once-sleepy downtown into a business center that promoters have dubbed “The Wall Street of the South.”</p><p>Other house-hunters headed south&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2021/09/17/manalapan-estate-near-palm-beach-brings-nearly-31-million-mls/8369511002/\"><u>to&nbsp;Manalapan</u></a>&nbsp;and Delray&nbsp;Beach&nbsp;or north to gated communities in the&nbsp;Palm&nbsp;Beach&nbsp;Gardens area and Jupiter. All of those areas saw sharp spikes in sales and prices in 2021.</p><img src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/1a4a6df7-2f2a-4cbc-a24b-b567061dbf79-PBN_rear_rs_Brantley_320_Island_Rd.webp?resize=1024%2C684&amp;ssl=1\" alt=\"\"><h2>4. When did Palm Beach’s real estate market begin to cool?&nbsp;</h2><p>By the end of 2023, real estate agents and brokers noticed that&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/01/18/palm-beach-florida-real-estate-sales-volume-fell-in-2023-fourth-quarter-sales-reports-confirm/72257487007/\"><u>the pandemic-induced frenzy of sales had begun to cool</u></a>, although Palm Beach still saw nearly $2 billion worth of single-family deals close that year, according to a sales&nbsp;report issued by the Frisbie Palm Beach Real Estate Group.</p><p>The total dollar amount of Palm Beach sales of single-family houses, townhomes and vacant land slipped to about $1.9 billion in 2023 from $2.25 billion&nbsp;the year before, the Frisbie report showed, noting that the bloom also was off condo and co-op sales.</p><p>Many condos and co-op buildings, meanwhile, have been facing their own challenges, as owners there scramble to meeting strict state requirements for concrete restoration and reserve funds in the wake of the 2021 deadly collapse of a major multifamily building in the Miami suburb of Surfside.</p><img src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/770c8d87-d0a7-45c1-b070-77f35514a935-PBN_HiRes_Balc_E4B_110_Sunset_Ave_LivingProof.webp?resize=1024%2C684&amp;ssl=1\" alt=\"\"><h2>5. Where does the Palm Beach real estate market stand today?&nbsp;</h2><p>Although real estate sale prices in Palm Beach&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/news/2023/04/27/record-sale-in-palm-beach-as-home-goes-for-around-170-million-to-beat-local-and-likely-state-record/70156217007/\"><u>can still grab headlines</u></a>, they are no longer escalating at the whirl-a-minute pace they once were. Asking prices, too, have in many cases moderated as sellers have&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/05/05/palm-beach-real-estate-market-still-busy-as-winter-season-draws-to-end/73498239007/\"><u>gradually let go of expectations that no longer align with the realities</u></a>&nbsp;of the post-pandemic boom. Wealthy buyers too, have become more discerning, once again taking their time to find the right property and engaging in hardline negotiations for prices.</p><p>That’s especially true for people who&nbsp;may&nbsp;have bought something less than the home of their dreams during the mad rush of the pandemic’s early years, just to get a foot in the island’s door. Over the past two years, they have been watching the Palm Beach market carefully for homes that better suit their needs.</p><p>Even so, properties continue to sell for far more than they did before the health crisis hit, a direct reflection of what is still a relatively limited supply of single-family residences, according to sales reports issued by real estate agencies that do business on the island.</p><p>The higher price bar also has put Palm Beach out of the reach of buyers who can’t afford — or aren’t willing to pay — the price of entry into the island’s housing market, which generally has settled in the&nbsp;$11 million-to-$14 million range for an entry-level single-family house.&nbsp;</p><p>Some sales of Palm Beach real estate, of course, still close at staggering prices. In early February, two vacant oceanfront lots measuring 2.26 acres sold together for&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2025/02/21/palm-beach-florida-sale-of-2-seaside-lots-likely-hit-at-least-165-million-sources-say/79339059007/\"><u>a price said to have hit at least $160 million</u></a>&nbsp;in a private deal at 1063 and 1071 N. Ocean Blvd. for which no deed has ever been recorded. Last year, too, saw two other properties sell at eye-popping prices that ranked them&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2025/01/02/take-a-look-at-2024s-priciest-real-estate-sales-in-palm-beach-florida-including-150-million-whopper/77356932007/\"><u>among the country’s largest real estate transactions</u></a>&nbsp;— a renovated-and-expanded mega-mansion on private Tarpon Island&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/05/17/floridas-tarpon-island-sells-for-152-million-setting-a-palm-beach-lakefront-real-estate-record/73602996007/\"><u>sold for a recorded $150 million</u></a>; and an oceanfront landmarked estate at 455 S. Ocean Blvd.&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/06/17/palm-beach-house-could-sell-for-as-much-as-160-million-sources-say/74118028007/\"><u>changed hands privately for a recorded $148 million</u></a>.</p><p>And November’s election of President Donald Trump to his second term gave&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/11/29/trumps-election-shines-spotlight-on-palm-beach-florida-and-its-pricey-real-estate/76624250007/\"><u>an immediate and noticeable boost to the market as Palm Beach</u></a>&nbsp;— home to the chief executive’s residence at his Mar-a-Lago Club — once again landed in the international spotlight.</p><p>But real estate observers also have noted a growing sense of uncertainty among some would-be homebuyers over the past few weeks in the wake of Trump’s trade wars with Canada, Mexico and China; the firings of thousands of federal employees; and his myriad executive orders to shake up the way the government has traditionally done business.</p><p>The island’s housing market has also seen a flurry of price reductions since the New Year, especially for condos.</p><p>Whether the so-called “Trump bump” lasts, one thing is clear: Palm Beach real estate entered a new and unanticipated era five years ago, sparked by — of all things — a deadly and tragic global pandemic.</p>",
      "excerpt": "<h3>The real-estate frenzy sparked by the arrival of coronavirus pandemic in 2020 has had lasting effects on Palm Beach real estate. Here are some hig...",
      "image": "/uploads/3fe098cd-5358-4eb1-b95a-90f76094ec02-pandemicpost.jpg"
    },
    {
      "id": "1745633191895",
      "title": " Palm Beach Luxury Real Estate, 4th Quarter Market Report",
      "slug": "-palm-beach-luxury-real-estate-4th-quarter-market-report",
      "date": "2025-01-16",
      "author": "Linda R. Olsson",
      "content": "<p><p>Just Listed!&nbsp;<a href=\"https://www.flexmls.com/cgi-bin/mainmenu.cgi?cmd=url+other/run_public_link.html&amp;public_link_tech_id=1weonht7zyrq&amp;s=6&amp;id=1&amp;san=29269&amp;cid=1\" target=\"_blank\" rel=\"noreferrer noopener\">218 El Brillo Way</a>&nbsp;-$23,900,000Dear Buyers, Sellers, Clients, and Friends…</p><p><strong>Happy New Year!&nbsp;We are excited to ring in the New Year, and thankful we have the pleasure of working with you…</strong>We could not be more appreciative of your business.&nbsp;We have been uniting Extraordinary People with Exceptional Properties since 1989.&nbsp;We are proud to represent your best interests with professionalism…Your confidence in us means so much.&nbsp;With 5 Star Google reviews, we couldn’t be more proud. Thank you!</p><p><strong>It is a pleasure to share our&nbsp;<a href=\"https://www.lindaolsson.com/wp-content/uploads/2025/01/2024-market-report-4th-quarter.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Fourth Quarter Market Report</a>&nbsp;with you, we are all excited to ring in the New Year, as the Fourth Quarter had everyone holding their breath due to the Presidential Election and Holiday Festivities, which is clear by the amount of sales this quarter compared to the past three quarters in 2024.</strong></p><p><strong>Area 1: (Inlet Drive to Wells Road) 6 homes SOLD</strong></p><p>Average price: $20,195,000 – Average per sq.ft. $3,059</p><p>Highest priced per sq.ft. 1446 N Ocean Blvd – $7,336</p><p>Lowest priced per sq.ft. 210 Jamaica Lane – $1,911</p><p><strong>Area 2: (Wells Road to Worth Ave.) 7 homes SOLD</strong></p><p>Average price: $13,990,750 – Average per sq.ft. $3,545</p><p>Highest priced per sq.ft. 322 Clarke Ave – $7,253</p><p>Lowest priced per sq.ft.&nbsp;221 Atlantic Ave. – $2,365</p><p><strong>Area 3: (Worth Avenue to Sloan’s Curve) 1 homes SOLD</strong></p><p>Highest priced per sq.ft. 130 Algoma Road– $1,951</p><p><strong>Area 2: CONDOS (Worth Avenue to Wells Road) 5 condos SOLD</strong></p><p>Average price: $5,950,000 – Average per sq.ft. $2,476</p><p>Highest priced per sq.ft. 2 N Breakers Row N42 – $3,585</p><p>Lowest priced per sq.ft. 100 Sunrise Ave 517 – $1,782</p><p><strong>This year promises to be strong!</strong>&nbsp;Palm Beach is the center of the World it seems with everyone focusing on Mar-a-Lago as the “Winter White House”, and we all know that Palm Beach provides all of us a glorious lifestyle of convenience, security, beauty, and a strong community of dedicated people.&nbsp;We are blessed to live in Paradise…The people make this community special as do the local businesses, restaurants and shops that make this Town so unique.&nbsp;I have personally had the pleasure of living in Palm Beach since 1998, and I cannot recommend it more.&nbsp;Everyone gets involved in what they love, there are so many options available to us…Lectures, Art Exhibits, Golf, Tennis, Boating, the Beach, etc…It’s just Wonderful!</p><!--EndFragment-->\n\n<br></p>",
      "excerpt": "Just Listed! 218 El Brillo Way -$23,900,000Dear Buyers, Sellers, Clients, and Friends…Happy New Year! We are excited to ring in the New Year, and...",
      "image": "/uploads/ff2ba27d-7c37-4238-8ded-14a0c443f63d-jan16.jpeg"
    },
    {
      "id": "1745633271374",
      "title": "Prestigious Ocean Block – 165 Seminole Ave. Best Opportunity in Town, Must See",
      "slug": "prestigious-ocean-block-165-seminole-ave-best-opportunity-in-town-must-see",
      "date": "2025-03-20",
      "author": "Linda R. Olsson",
      "content": "<p><h2 class=\"__className_127ae0\" style=\"color: rgb(22, 101, 52); font-weight: 300;\">$9,995,000 – Rare Find…One Story, CBS Construction,&nbsp;3,900 sq. ft., 4 BD, 4.5 BA with 11 ft. Ceilings,&nbsp;Situated on a 13,358 sq. ft. High Elevation Lot in the Heart of Town.</h2><div><figure><img data-recalc-dims=\"1\" decoding=\"async\" width=\"1024\" height=\"519\" src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image2-1.jpeg?resize=1024%2C519&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image2-1.jpeg?resize=1024%2C519&amp;ssl=1 1024w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image2-1.jpeg?resize=300%2C152&amp;ssl=1 300w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image2-1.jpeg?resize=1060%2C538&amp;ssl=1 1060w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image2-1.jpeg?w=1400&amp;ssl=1 1400w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"></figure></div><h2 class=\"__className_127ae0\" style=\"color: rgb(22, 101, 52); font-weight: 300;\">Steps from the Beach, Publix, and Houses of Worship.&nbsp;Impeccable condition, Large Yard, Pool, and Garage.</h2><div><figure><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3.jpeg?resize=1024%2C683&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3.jpeg?resize=1024%2C683&amp;ssl=1 1024w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3.jpeg?resize=300%2C200&amp;ssl=1 300w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3.jpeg?resize=1060%2C707&amp;ssl=1 1060w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3.jpeg?resize=600%2C400&amp;ssl=1 600w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3.jpeg?w=1500&amp;ssl=1 1500w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"></figure></div><h2 class=\"__className_127ae0\" style=\"color: rgb(22, 101, 52); font-weight: 300;\">Just Move In, Renovate or Build your Dream Home!</h2><div><figure><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image4.jpeg?resize=1024%2C683&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image4.jpeg?resize=1024%2C683&amp;ssl=1 1024w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image4.jpeg?resize=300%2C200&amp;ssl=1 300w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image4.jpeg?resize=1060%2C707&amp;ssl=1 1060w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image4.jpeg?resize=600%2C400&amp;ssl=1 600w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image4.jpeg?w=1500&amp;ssl=1 1500w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"></figure></div><div><figure><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"791\" height=\"1024\" src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-2.jpeg?resize=791%2C1024&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-2-scaled.jpeg?resize=791%2C1024&amp;ssl=1 791w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-2-scaled.jpeg?resize=232%2C300&amp;ssl=1 232w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-2-scaled.jpeg?resize=1187%2C1536&amp;ssl=1 1187w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-2-scaled.jpeg?resize=1583%2C2048&amp;ssl=1 1583w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-2-scaled.jpeg?resize=1060%2C1372&amp;ssl=1 1060w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-2-scaled.jpeg?w=1978&amp;ssl=1 1978w\" sizes=\"auto, (max-width: 791px) 100vw, 791px\"></figure></div><!--EndFragment-->\n\n<br></p>",
      "excerpt": "$9,995,000 – Rare Find…One Story, CBS Construction, 3,900 sq. ft., 4 BD, 4.5 BA with 11 ft. Ceilings, Situated on a 13,358 sq. ft. High Elevation...",
      "image": "/uploads/03677d36-4c51-473a-9b11-f782eb6b4777-march20.jpeg"
    },
    {
      "id": "1745633350026",
      "title": "Just Listed… 218 El Brillo Way. First Time On the Market in 28 Years!",
      "slug": "just-listed-218-el-brillo-way-first-time-on-the-market-in-28-years",
      "date": "2025-03-24",
      "author": "Carolina Olsson",
      "content": "<p>\n\n<!--StartFragment--></p><div><figure><img data-recalc-dims=\"1\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-3.jpeg?resize=1024%2C683&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-3.jpeg?resize=1024%2C683&amp;ssl=1 1024w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-3.jpeg?resize=300%2C200&amp;ssl=1 300w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-3.jpeg?resize=1536%2C1024&amp;ssl=1 1536w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-3.jpeg?resize=1060%2C707&amp;ssl=1 1060w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-3.jpeg?resize=600%2C400&amp;ssl=1 600w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-3.jpeg?w=2047&amp;ssl=1 2047w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"></figure></div><h2 class=\"__className_127ae0\" style=\"color: rgb(22, 101, 52); font-weight: 300;\"><strong>$23,900,000</strong></h2><h2 class=\"__className_127ae0\" style=\"color: rgb(22, 101, 52); font-weight: 300;\">Prestigious Estate Section- South Exposure Classic Built by Gustav Maass in 1950 situated on a Lushly Landscaped 22,888 sq. ft. Lot. Gracious Monterey-Style 6BD, 4.2 BA,&nbsp;Oak Paneled Office, Formal Living Room with Fireplace, Dining Room, Covered Loggia Overlooking Expansive Gardens.&nbsp;Fabulous Family/Media Room Overlooking the&nbsp;Coquina Stone Patio Leading to the Private Pool. Two Car Garage and Generator too! Prestigious Street with&nbsp;140 ft. Frontage on El Brillo Way. Unique Opportunity, Must See!</h2><div><figure><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image2-2.jpeg?resize=1024%2C683&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image2-2.jpeg?resize=1024%2C683&amp;ssl=1 1024w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image2-2.jpeg?resize=300%2C200&amp;ssl=1 300w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image2-2.jpeg?resize=1536%2C1024&amp;ssl=1 1536w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image2-2.jpeg?resize=1060%2C707&amp;ssl=1 1060w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image2-2.jpeg?resize=600%2C400&amp;ssl=1 600w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image2-2.jpeg?w=2047&amp;ssl=1 2047w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"></figure></div><div><figure><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3-1.jpeg?resize=1024%2C683&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3-1.jpeg?resize=1024%2C683&amp;ssl=1 1024w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3-1.jpeg?resize=300%2C200&amp;ssl=1 300w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3-1.jpeg?resize=1536%2C1024&amp;ssl=1 1536w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3-1.jpeg?resize=1060%2C707&amp;ssl=1 1060w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3-1.jpeg?resize=600%2C400&amp;ssl=1 600w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image3-1.jpeg?w=2047&amp;ssl=1 2047w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"></figure></div><div><figure><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"792\" src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-2-1.jpeg?resize=1024%2C792&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-2-1.jpeg?resize=1024%2C792&amp;ssl=1 1024w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-2-1.jpeg?resize=300%2C232&amp;ssl=1 300w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-2-1.jpeg?resize=1060%2C820&amp;ssl=1 1060w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-2-1.jpeg?w=1243&amp;ssl=1 1243w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"></figure></div><!--EndFragment-->\n\n<br><p></p>",
      "excerpt": "$23,900,000Prestigious Estate Section- South Exposure Classic Built by Gustav Maass in 1950 situated on a Lushly Landscaped 22,888 sq. ft. Lot....",
      "image": "https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2025/03/image1-3.jpeg?resize=1024%2C683&amp;ssl=1"
    },
    {
      "id": "1745633479155",
      "title": "Palm Beach’s Summer Saw Multiple High-End Home Sales. Is a Busy Real Estate Season Ahead?",
      "slug": "palm-beachs-summer-saw-multiple-highend-home-sales-is-a-busy-real-estate-season-ahead",
      "date": "2024-11-01",
      "author": "Linda R. Olsson",
      "content": "<p><h2 class=\"__className_127ae0\" style=\"color: rgb(22, 101, 52); font-weight: 300;\">Even with inventory on the rise, the wealthy town faces some real estate challenges, including picky buyers. Here’s a preview of what could be a busy season.</h2><p>With the busy winter season rushing toward&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/news/2024/04/02/worlds-richest-palm-beach-florida-is-home-to-at-least-56-billionaires-ranked-by-forbes/73179172007/\" target=\"_blank\" rel=\"noreferrer noopener\">ultra-wealthy Palm Beach</a>, the local real estate market is settling into a new reality, where many discerning&nbsp;homebuyers who want to own a piece of the island are giving their options a harder look before making any decision to buy.&nbsp;</p><p>And those shoppers are continuing to find a limited inventory of single-family homes, especially better-quality properties that are new, newer or newly renovated on the water.&nbsp;</p><p>The supply of on-the-market houses continues to inch up from historic lows caused by a whirlwind of sales that accompanied&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2022/01/20/palm-beach-2021-home-sales-hit-4-billion-inventory-tight-q-4-reports/6566691001/\" target=\"_blank\" rel=\"noreferrer noopener\">the go-go years of the pandemic-induced boom</a>&nbsp;that began in 2020.&nbsp;That boom sharply&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2023/10/23/higher-real-estate-prices-now-likely-entrenched-in-palm-beach/71220377007/\" target=\"_blank\" rel=\"noreferrer noopener\">raised the bar for home prices</a>, which continue to be substantially higher&nbsp;than those before the pandemic, according to the sales analyses released quarterly by real estate agencies who do business on the island.&nbsp;</p><p>And there’s no shortage of would-be buyers, who see Palm Beach as one of the most desirable places in the country —and perhaps the world — to own a home, local real estate agents and brokers agree.&nbsp;</p><p>The resulting tug-of-war between the still-limited supply of single-family homes and strong interest from would-be buyers continues to characterize the island’s real estate scene, according to a just-released third-quarter sales report from&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2023/03/22/brown-harris-stevens-honors-palm-beach-agents-for-sales-worth-millions/70033501007/\" target=\"_blank\" rel=\"noreferrer noopener\">Brown Harris Stevens</a>.&nbsp;</p><p>“General market fundamentals remain strong with persistent demand and under-supplied market,” the Brown Harris Stevens report said.</p><figure><img data-recalc-dims=\"1\" decoding=\"async\" width=\"660\" height=\"394\" src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/1446-N.-Ocean-Blvd.-Palm-Beach.webp?resize=660%2C394&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/1446-N.-Ocean-Blvd.-Palm-Beach.webp?w=660&amp;ssl=1 660w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/1446-N.-Ocean-Blvd.-Palm-Beach.webp?resize=300%2C179&amp;ssl=1 300w\" sizes=\"(max-width: 660px) 100vw, 660px\"></figure><p>Even so, Palm Beach house-hunters today are far different from those of the pandemic years.&nbsp;</p><p>“There’s less urgency for buyers to make a decision,” broker&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/06/04/lakefront-house-near-historic-palm-beach-church-sells-for-nearly-50-million/73929350007/\" target=\"_blank\" rel=\"noreferrer noopener\">Christian Angle of Christian Angle Real Estate</a>&nbsp;acknowledged. “The buyers are out there, but they want something that aligns (more precisely) with what they are looking for. But they still want to be in Palm Beach. Throughout the summer, there was a steady flow of traffic (of potential buyers).”&nbsp;</p><p>Such deep-pocketed buyers — who are no&nbsp;longer willing to settle for just any property — have forced Palm Beach sellers over the past year to temper their asking-price expectations. The&nbsp;market lately has seen&nbsp;multiple price reductions — and, no doubt, some tough talk at negotiating tables&nbsp;— before buyers have finally taken a bite.</p><p>Even with downward asking-price adjustments, sellers by and large will be getting far more for their properties today than they would have five years ago.</p><p>Palm Beach also is coming off a summer that began with a bang, thanks in part to the May sale,&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/05/17/floridas-tarpon-island-sells-for-152-million-setting-a-palm-beach-lakefront-real-estate-record/73602996007/\" target=\"_blank\" rel=\"noreferrer noopener\">recorded at $150 million, of private Tarpon Island</a>&nbsp;and its renovated-and-expanded mansion. That sale was followed in June by an off-market deal,&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/06/17/palm-beach-house-could-sell-for-as-much-as-160-million-sources-say/74118028007/\" target=\"_blank\" rel=\"noreferrer noopener\">recorded at $148 million, for the landmarked ocean-to-lake estate</a>&nbsp;known as Amado at 455 N. County Road.</p><figure><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"684\" src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/West-Palm-Beach-Skyline.webp?resize=1024%2C684&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/West-Palm-Beach-Skyline.webp?resize=1024%2C684&amp;ssl=1 1024w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/West-Palm-Beach-Skyline.webp?resize=300%2C200&amp;ssl=1 300w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/West-Palm-Beach-Skyline.webp?resize=600%2C400&amp;ssl=1 600w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/West-Palm-Beach-Skyline.webp?w=1320&amp;ssl=1 1320w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"></figure><p>In all, nine sales were documented during the off-season — between May 1 and Oct. 18 — at $39 million or more, with the majority closing in&nbsp;May, June and July. During the same period last year, there were five transactions in that heady price category.&nbsp;</p><p>Perhaps it’s not surprising, then, that the total dollar volume generated by Palm Beach sales rose in the second and third quarters of the year compared to the same period in 2023. Town-wide sales of single-family properties, condominiums and co-operative units for two quarters totaled about $1.44 billion, up from&nbsp;last year’s total of&nbsp;$1.16 billion, according to sales reports released by Frisbie Real Estate, which is headed by agent&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/07/03/rebuilt-palm-beach-home-involved-in-water-damage-lawsuit-sells-for-more-than-51-million/74206534007/\" target=\"_blank\" rel=\"noreferrer noopener\">Suzanne Frisbie of the Corcoran Group</a>.&nbsp;</p><p>And overall sales in the third quarter were slightly up, year over year, the latest reports generally agreed, although apples-to-apples comparisons are difficult because different agencies use different criteria to track transactions.&nbsp;</p><p>Here are a few more takeaways from the summer — including a closer look at data from the new third-quarter sales reports — as well as some insights into what buyers and sellers might see in the coming months.&nbsp;</p><h2 class=\"__className_127ae0\" style=\"color: rgb(22, 101, 52); font-weight: 300;\">On the single-family home scene</h2><p>It’s&nbsp;costing buyers less right now to get a foot in the door to the Palm Beach real estate market than it did a year ago. Last year at this time, sales reports consistently noted the lack of sales below $10 million,&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2023/10/23/higher-real-estate-prices-now-likely-entrenched-in-palm-beach/71220377007/\" target=\"_blank\" rel=\"noreferrer noopener\">a price described at the time as the “entry point” into the Palm Beach market</a>.&nbsp;</p><p>But in the quarter that just ended, far more properties sold at less than $10 million. That fact is reflected in the&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2023/07/27/corcoran-loses-south-florida-regional-manager-to-new-golf-community/70465115007/\" target=\"_blank\" rel=\"noreferrer noopener\">Corcoran Group</a>’s third-quarter report, which noted that average and median sale prices for single-family properties fell 40% and 45%, respectively, in a year-over-year comparison. The median price is the price at which half of the properties sold for more and half for less.</p><figure><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"537\" src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/123-Australian-Ave.-Midtown-Palm-Beach.webp?resize=1024%2C537&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/123-Australian-Ave.-Midtown-Palm-Beach.webp?resize=1024%2C537&amp;ssl=1 1024w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/123-Australian-Ave.-Midtown-Palm-Beach.webp?resize=300%2C157&amp;ssl=1 300w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/123-Australian-Ave.-Midtown-Palm-Beach.webp?w=1320&amp;ssl=1 1320w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"></figure><p>In July, August and September, “nearly half of all closings sold below ($10 million) compared to last year, when only one sale traded below this price point. Despite the annual percentage declines in pricing this quarter, (the) single-family average price has exceeded ($11 million) every quarter since 2021,” said the Corcoran Report, which was issued separately from the one from Frisbie Real Estate’s analysis.</p><p>The supply of single-family properties in the third quarter climbed by 17% during the third quarter in a year-over-year comparison, according to the sales report just released by&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/03/20/douglas-ellimans-palm-beach-agents-earn-ellie-awards-for-2023-sales/73025825007/\" target=\"_blank\" rel=\"noreferrer noopener\">Douglas Elliman Real Estate</a>. But the inventory remained far less than what was available in 2019, before the pandemic hit.</p><p>An MLS search of “active” listings Oct. 18 showed 82 houses and townhomes on the market. A few of those properties were also listed as potential tear-downs among the 13 listings in the “land-acreage” category.</p><p>And two of the newest additions to the single-family listings were whoppers: A remodeled lakefront home at 1460 N. Lake Way has&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/10/04/renovated-palm-beach-estate-lists-at-95-million-next-door-to-sylvester-stallones-home/75515632007/\" target=\"_blank\" rel=\"noreferrer noopener\">entered the market at $95 million</a>, while a new oceanside mansion developed on speculation at 1540 S. Ocean Blvd.&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/10/17/new-estate-priced-at-88-million-on-palm-beachs-billionaires-row-south-of-trumps-mar-a-lago/75721250007/\" target=\"_blank\" rel=\"noreferrer noopener\">is asking $88 million</a>.</p><figure><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"612\" src=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/Featured-Image-Palm-Beach-real-estate-season.webp?resize=1024%2C612&amp;ssl=1\" alt=\"Featured Image Palm Beach real estate season\" srcset=\"https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/Featured-Image-Palm-Beach-real-estate-season.webp?resize=1024%2C612&amp;ssl=1 1024w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/Featured-Image-Palm-Beach-real-estate-season.webp?resize=300%2C179&amp;ssl=1 300w, https://i0.wp.com/www.lindaolsson.com/wp-content/uploads/2024/11/Featured-Image-Palm-Beach-real-estate-season.webp?w=1219&amp;ssl=1 1219w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"></figure><p>Meanwhile, a $96 million listing for a direct-beachfront estate at 1446 N. Ocean Blvd.&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2024/07/30/beachfront-home-listed-at-96-million-zooms-under-contract-in-palm-beach-florida-real-estate/74530046007/\" target=\"_blank\" rel=\"noreferrer noopener\">remains under contract</a>&nbsp;on the North End, one of seven properties in the MLS’s “pending” category.</p><p>But listings in the MLS don’t tell the whole story about what’s available for sale in Palm Beach. Fully 25% of the sales in July, August and September, for instance, involved properties that changed hands in off-market deals in the area stretching from northern tip of the island to Sloan’s Curve, according to a&nbsp;just-released sales report from&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/lifestyle/real-estate/2019/09/13/hurricane-dorian-palm-beachs-fanjul-family-mounts-bahamian-relief-campaigns/2781670007/\" target=\"_blank\" rel=\"noreferrer noopener\">Tina Fanjul Associates</a>.&nbsp;</p><h2 class=\"__className_127ae0\" style=\"color: rgb(22, 101, 52); font-weight: 300;\">Condos, co-ops and rentals</h2><p>Buyers at this point will&nbsp;find far more condos and co-ops on the market than they did a year ago, according to the latest round of third-quarter sales reports. The analyses also show more condos sold in the third quarter in a year-over-year comparison at higher prices. &nbsp;</p><p>Palm Beach’s multifamily market “showed sustained growth” during the third quarter compared to the same period last year, the Brown Harris Stevens reports said. “The market continues to be buoyed by strong demand and constrained inventory.”&nbsp;</p><p>The Elliman Report, meanwhile, noted the number of condominiums for sale during the third quarter jumped by more than 45% compared to a year ago.</p><p>A recent search of the MLS revealed 52 condos and co-ops for sale in Midtown at prices ranging from $16.5 million to $1.5 million. Three more Midtown units were priced below $1 million.&nbsp;</p><p>On the South End’s so-called Condominium Row, 77 units were for sale, priced at between about $7.5 million and $366,000. Three others were asking less than $300,000.&nbsp;</p><p>But the island’s condominium owners also are facing unprecedented challenges.&nbsp;Work crews over the summer at many buildings were carrying out renovations, concrete restoration and maintenance work, often in phased work plans. Much of that construction&nbsp;is related to&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/news/local/jupiter/2024/07/17/surfside-law-forces-sale-of-jupiter-beachfront-condo/74322269007/\" target=\"_blank\" rel=\"noreferrer noopener\">new state regulations</a>&nbsp;put in place to help ensure the integrity of multifamily buildings in the wake of the deadly 2021 collapse of a beachfront condo in Miami-Dade County’s Surfside community.&nbsp;</p><p>And some condo owners may want to sell their apartments to avoid paying anticipated, and sometimes substantial, assessments related to the new regulations.&nbsp;</p><p>Older condos in Palm Beach also are facing increased competition from new luxury and ultra-luxury buildings “across the bridges” that have either opened or are planned for West Palm Beach and other cities.&nbsp;</p><p>Those looking to lease a house or condo in Palm Beach for the season still have plenty of options — a big change from the pandemic years, when the island saw super-tight inventory in the rental market as more people moved here year-round.&nbsp;A search of the MLS early last week showed 47 single-family properties and 123 condominiums and co-ops for lease, although prices and availability varied widely.&nbsp;</p><p>Broker&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/news/local/2014/04/21/lifelong-commitment/9663911007/\" target=\"_blank\" rel=\"noreferrer noopener\">Linda Olsson of Linda R. Olsson Inc.</a>&nbsp;specializes in single-family sales but also handles rentals.&nbsp;She suspects that people have been slower to rent this season because they are back to following pre-pandemic patterns. That includes extending their summer stays at their homes up North or vacationing elsewhere in September and this month.&nbsp;</p><p>“Many are traveling in Europe,” Olsson said. “They didn’t want to go during the (height of) the summer.”&nbsp;</p><p>She added: “When I’ve called my people in Nantucket (in Massachusetts), they’re staying there (for a while). But I still think they’re going to flock here once the season really gets underway. No doubt. I think for many people, Palm Beach will be very seasonal again, which we haven’t seen in a while.”&nbsp;</p><h2 class=\"__className_127ae0\" style=\"color: rgb(22, 101, 52); font-weight: 300;\">Is an active real estate season ahead?&nbsp;</h2><p>Brokers and agents have told the Palm Beach Daily News they are expecting a busy season, and not just because buyers will still be competing for properties.&nbsp;</p><p>The&nbsp;uncertainty preceding the Nov. 5 presidential election will have receded, they noted.&nbsp;</p><p>Falling interest rates may also be a factor to spur purchases, although a statement accompanying Douglas Elliman Real Estate’s just-released third-quarter sales report showed that 75% of Palm Beach transactions were cash deals for properties in the multiple listing service.&nbsp;</p><p>And it remains unclear if the active hurricane season that ends Nov. 30 — and included&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/news/weather/2024/10/15/hurricane-deaths-2024-helene-milton-atlantic-season/75678995007/\" target=\"_blank\" rel=\"noreferrer noopener\">three destructive hurricanes that struck Florida’s Gulf Coast</a>&nbsp;but generally spared Palm Beach — will have any effect on decisions made by homebuyers and sellers on the island.&nbsp;</p><p>Broker Angle is among those anticipating that this real estate season will be a busy one. “We’ve come out of a pretty active summer selling period,” Angle said. “We have a firm marketplace, pricing is strong, inventory is down and demand to be in our community (is) strong, even if the sense of urgency (on the part of buyers) is tempered today.”&nbsp;</p><p>He cited many of the characteristics that attract people to Palm Beach: Florida’s relatively favorable tax climate compared to many other states; the island’s natural beauty and handsome architecture; its reputation for security; and its proximity to downtown West Palm Beach, which is undergoing a major revitalization fueled by corporate relocations.&nbsp;</p><p>Agent&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2022/05/12/palm-beach-real-estate-agent-brandt-joins-premier-estate-properties/9724095002/\" target=\"_blank\" rel=\"noreferrer noopener\">Margit Brandt of Premier Estate Properties</a>&nbsp;mentioned that many buyers also see Palm Beach real estate as a key part of their investment strategy.&nbsp;“A lot of these buyers are looking to allocate capital but also enjoy the investment,” she said. “I’m seeing an influx of people from all over the country who want to come here.”&nbsp;</p><p>Analyst&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/news/2020/12/11/chamber-panel-zooms-real-estate-palm-beachs-economic-driver/3879093001/\" target=\"_blank\" rel=\"noreferrer noopener\">Jonathan Miller</a>, who prepares the Elliman Report, described Palm Beach real estate as “an engine that doesn’t know how to stop.” &nbsp;Real estate activity in town “is similar to much of the South Florida region, in that prices are rising and listing inventory is also rising. But Palm Beach is one of the few places that is seeing more sales,” said Miller, who heads Miller Samuel Inc. in New York City.&nbsp;</p><p>In her agency’s third-quarter report,&nbsp;<a href=\"https://www.palmbeachdailynews.com/story/business/real-estate/2023/02/21/who-is-now-leading-sothebys-intl-realtys-palm-beach-brokerages/69926596007/\" target=\"_blank\" rel=\"noreferrer noopener\">Sotheby’s International Realty Brokerage Manager Jessica Shapiro</a>&nbsp;stressed the uptick in listing inventory, one of the reasons she is “very optimistic for a busy season.”</p><p>*<em>The latest third-quarter sales reports for Palm Beach are expected to be available at&nbsp;<a href=\"https://media.bhsusa.com/pdf/3Q24_PB_MARKET_REPORT_Final.pdf\">BHSUSA.com</a>,</em>&nbsp;<em><a href=\"https://www.ecorcoran.com/uploaded_doc/The_Corcoran_Report_Coastal_Palm_Beaches_3Q_2024.pdf\">Inhabit.Corcoran.com</a>,&nbsp;<a href=\"https://www.elliman.com/corporate-resources/market-reports\">Elliman.com</a>,&nbsp;<a href=\"https://fanjulrealestate.com/\">FanjulRealEstate.com</a>,&nbsp;<a href=\"https://www.frisbiepalmbeach.com/market-data/\">FrisbiePalmBeach.com</a>,&nbsp;<a href=\"https://www.lindaolsson.com/market-reports/\">LindaOlsson.com</a>,&nbsp;and&nbsp;<a href=\"https://homes.sothebysrealty.com/q3-2024-palm-beach-market-insights/full-view.html\">SothebysRealty.com</a>.</em></p><!--EndFragment-->\n\n<br></p>",
      "excerpt": "Even with inventory on the rise, the wealthy town faces some real estate challenges, including picky buyers. Here’s a preview of what could be a...",
      "image": "/uploads/a5856c6d-2ec7-45be-b9ee-79103ca69565-nov21.jpg"
    },
    {
      "id": "1745633728502",
      "title": "Palm Beach Luxury Real Estate, Third Quarter Market Report",
      "slug": "palm-beach-luxury-real-estate-third-quarter-market-report",
      "date": "2025-04-26",
      "author": "Linda R. Olsson",
      "content": "<p><p>Dear Buyers, Sellers, Clients and Friends,</p><p><strong>Palm Beach is a lifestyle destination, as it has always been since Henry Flagler completed the 1,100-room Royal Poinciana Hotel on the shores of Lake Worth in Palm Beach and extended his railroad to its service town, West Palm Beach by 1894.&nbsp;Founding Palm Beach and West Palm Beach, he completed the world-class Breakers Hotel in Palm Beach overlooking the Atlantic Ocean in 1901.</strong></p><p><strong>Today, people are looking for more from their homes…Their community, security and lifestyle is important.</strong>&nbsp;Palm Beach is paradise, there is no place in the world that compares. Our Island offers a luxurious lifestyle with incomparable amenities for families who desire not only the beauty of the island setting with our gorgeous beaches, boating on the intracoastal waterway, and golf; but the it’s the “intimacy of the Palm Beach community” that makes Palm Beach so unique and the opportunity to interact and become involved in the town on so many levels with its Civic Association, Preservation Foundation, The Garden Club, historical societies, private membership clubs, and the fabulous Palm Beach recreation center with tennis facilities, gym and educational opportunities, not to mention the diversity provided by our unmatched cultural institutions like the Society of the Four Arts and the Norton Museum. When you are purchasing a luxury home lifestyle and community is key, Palm Beach is second to none!</p><p><strong>We are pleased to share our&nbsp;<a href=\"https://www.lindaolsson.com/market-reports/\" target=\"_blank\" rel=\"noreferrer noopener\">Third Quarter Market Report</a>&nbsp;with you.</strong>&nbsp;The Season is fast approaching with many of our clients and friends continuing their pre-Covid routines staying longer in the Hamptons, Nantucket, and Maine, and taking that last trip to Europe before the Season heats up in two weeks on November 1.&nbsp;Sales this quarter were slower with uncertainty across the pond, the U.S. presidential election, and the buyer’s not yet “Thinking Palm Beach” as they continued enjoying their summers elsewhere.&nbsp;The homes sold in the third quarter report confirm the prices per square foot are strong and steady.&nbsp;As Dorothy said..<em>.”There’s no place like Home”</em>. We look forward to seeing everyone come November, when the cold weather sets in the North East, and everyone that’s anyone flocks back to Palm Beach to enjoy our Island Paradise and they begin their search for homes, condominiums, and land.&nbsp;So many of our residents are generational, they return to this glorious place to raise their families and continue their family traditions.</p><p><strong>Area 1: (Inlet Drive to Wells Road) 5 Homes Sold –</strong></p><p>Average price: $6,915,105 – Average per sq. ft. $1,958</p><p>Highest priced per sq. ft. 200 Bermuda Lane – $2,230</p><p>Lowest priced per sq. ft. 220 Onondaga Ave – $1,671</p><p><strong>Area 2: (Wells Road to Worth Ave.) 3 Homes Sold –</strong></p><p>Average price: $12,373,333 – Average per sq. ft. $2,682</p><p>Highest priced per sq. ft. 160 Chilean Ave – $3,393</p><p>Lowest priced per sq. ft. 201 Dunbar Road – $2,208</p><p><strong>Area 3: (Worth Avenue to Sloan’s Curve) 3 Homes Sold –</strong></p><p>Average price: $41,710,500 – Average per sq. ft. $3,770</p><p>Highest priced per sq. ft. 200 Via Palma – $4,150</p><p>Lowest priced per sq. ft. 101 Jungle Road – $3,212</p><p><strong>Area 2: CONDOS (Worth Avenue to Wells Road) 11 CONDOS SOLD</strong></p><p>Average price: $2,215,060 – Average per sq. ft. $1,727</p><p>Highest priced per sq. ft. 225 Everglade Ave 6 – $2,593</p><p>Lowest priced per sq. ft. 235 Sunrise Ave 3016 – $1,162</p><p><strong>Are you thinking about buying or selling in Palm Beach?&nbsp;</strong><strong>Uniting extraordinary people with extraordinary properties since 1989.&nbsp;</strong>We take pride in providing exceptional customer service,local expertise, and an unrivaled Website to you to service all your needs. Contact us for experience you can trust, we help you make your dreams come true!&nbsp;Preview all homes, condominiums and land listed for sale at&nbsp;<a href=\"https://www.lindaolsson.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Linda Olsson.com.</a></p><p><strong>Preview all listed homes for sale below:</strong></p><p><a href=\"https://www.flexmls.com/cgi-bin/mainmenu.cgi?cmd=url+other/run_public_link.html&amp;public_link_tech_id=1tx6vdiesjzp&amp;s=6&amp;id=1&amp;cid=1\" target=\"_blank\" rel=\"noreferrer noopener\">Area 1: North End- (Inlet Drive to Wells Road)</a></p><p><a href=\"https://www.flexmls.com/cgi-bin/mainmenu.cgi?cmd=url+other/run_public_link.html&amp;public_link_tech_id=1tx77weo1avs&amp;s=6&amp;id=1&amp;cid=1\" target=\"_blank\" rel=\"noreferrer noopener\">Area 2: In-Town – (Wells Road to Worth Avenue)</a></p><p><a href=\"https://www.flexmls.com/cgi-bin/mainmenu.cgi?cmd=url+other/run_public_link.html&amp;public_link_tech_id=1tx77wbj6fp1&amp;s=6&amp;id=1&amp;cid=1\" target=\"_blank\" rel=\"noreferrer noopener\">Area 3: Estate Section – (Worth Avenue to Sloan’s Curve)</a><br><a href=\"https://www.flexmls.com/cgi-bin/mainmenu.cgi?cmd=url+other/run_public_link.html&amp;public_link_tech_id=1tx783rn2y1a&amp;s=6&amp;id=1&amp;cid=1\" target=\"_blank\" rel=\"noreferrer noopener\">Area 2: Condos – (Wells Road to Worth Avenue)</a></p><p><strong>A Palm Beach resident since 1998, I love this town, and I am thankful for the many friends and clients I made over the years…</strong>&nbsp;I don’t know a place in the Country that I can recommend more than the lifestyle Palm Beach has provided to me personally.&nbsp;One can walk a block to a quiet beach to watch the sunrise, or along the intracoastal waterway to watch the sunset, take a walk or bike to the end of the island.&nbsp;Throw in world-class restaurants, and hotels like The Breakers and the Colony, not to mention world-class shopping on Worth Avenue and at The Royal, no taxi necessary!</p><p>We look forward to seeing you this Season.&nbsp;Contact us Today, we are available for you&nbsp;24/7.</p><!--EndFragment-->\n\n<br></p>",
      "excerpt": "Dear Buyers, Sellers, Clients and Friends,Palm Beach is a lifestyle destination, as it has always been since Henry Flagler completed the 1,100-room...",
      "image": "/uploads/8cf8cebd-22f0-4ce5-bf6b-fda3bcf09022-default.jpeg"
    }
  ]
}